blog/2021/git-credential.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 19:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Git Credential</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Git Credential</h1>
</header><p>
<a href="https://git-scm.com/docs/gitcredentials">https://git-scm.com/docs/gitcredentials</a>
</p>

<div id="outline-container-orgea0b64a" class="outline-2">
<h2 id="orgea0b64a">Credential 的描述</h2>
<div class="outline-text-2" id="text-orgea0b64a">
<p>
Git 有时需要来自用户的凭证来执行操作；例如，为了通过 HTTP 访问远程存储库，它可能需要请求用户名和密码。本手册描述了 Git 用于请求这些凭据的机制，以及避免重复输入这些凭据的一些特性。
</p>
</div>
</div>

<div id="outline-container-org903c9cb" class="outline-2">
<h2 id="org903c9cb">请求凭证</h2>
<div class="outline-text-2" id="text-org903c9cb">
<p>
在未定义凭证助手（credential helpers）的情况下，Git 会采用一下策略得到用户名和密码：
</p>

<ol class="org-ol">
<li>如果设置了 <code>GIT_ASKPASS</code> 环境变量，变量指定的程序会被触发。命令行会输出一个合理的提示，提醒用户输入用户名和密码</li>
<li>如果设置了 <code>core.askPass</code> 配置变量，它的行为如 1 所见</li>
<li>如果设置了 <code>SSH_ASKPASS</code> 环境变量，它的行为如 1 所见</li>
<li>否则，终端会提示用户</li>
</ol>
</div>
</div>

<div id="outline-container-org7740229" class="outline-2">
<h2 id="org7740229">避免冗杂</h2>
<div class="outline-text-2" id="text-org7740229">
<p>
重复输入某些凭证，令人讨厌。Git 提供了两种解决办法：
</p>

<ol class="org-ol">
<li>用于给定验证上下文的用户名的静态配置</li>
<li>凭据助手可以缓存或存储密码，或者与系统密码钱包或钥匙链进行交互</li>
</ol>

<p>
&#x2014;
</p>

<p>
<a href="https://stackoverflow.com/a/51327559">https://stackoverflow.com/a/51327559</a>
</p>

<p>
Git Credential 是为了保存用户名和密码而存在的，然而最安全的办法还是使用 SSH 密钥，不使用用户名和密码。
</p>
</div>
</div>

<div id="outline-container-org4bb3576" class="outline-2">
<h2 id="org4bb3576">使用 SSH 密钥</h2>
<div class="outline-text-2" id="text-org4bb3576">
<p>
创建好一个 SSH 密钥对，私匙保存在本地，公匙存放在目标服务器。在本地添加私匙到 ssh-agent：
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh-add ~/.ssh/id_rsa
</pre>
</div>
</div>
</div>

<div id="outline-container-org2855d6c" class="outline-2">
<h2 id="org2855d6c">Caching</h2>
<div class="outline-text-2" id="text-org2855d6c">
<div class="org-src-container">
<pre class="src src-sh">git config --global credential.helper cache
<span style="color: #706565;"># </span><span style="color: #857575;">or</span>
git config --global credential.helper <span style="color: #ddbc91;">'cache --timeout=3600'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9f7b801" class="outline-2">
<h2 id="org9f7b801">Store</h2>
<div class="outline-text-2" id="text-org9f7b801">
<p>
使用该选项，会将用户名和密码保存为纯文本，容易被窃取了。
</p>

<div class="org-src-container">
<pre class="src src-sh">git config credential.helper store
</pre>
</div>
</div>
</div>
</div>
</body>
</html>